app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'muhammadwachid@gmail.com'
 LIMIT 1
---
    public function login()
    {

        return view('auth/login');

        $userModel = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $email)->first();