app/Controllers/Dashboard.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `users`
---
    public function main()
    {
        $model = new UserModel();
        $data = $model->find(session()->get('user_id'));
        if (!session()->has('user')) {
            return redirect()->to('/login')->with('error', 'Anda harus login terlebih dahulu.');
        }

        return view('layouts/main', ['username' => session()->get('username')] , ['user' => $data]);