app/Controllers/Home.php

    public function index(): string
    {
        $orders = $this->pesananModel->findAll();

        $data = [
            'totalPesanan' => $this->pesananModel->countAllResults(),
            'pesananMenunggu' => $this->pesananModel->where('status', 'menunggu')->countAllResults(),
            'orders' => $orders,
        ];

        $pesananModel = new PesananPenggunaModel();

        $orders = $pesananModel->findAll();
---
SELECT *
FROM `pesananpengguna`