app/Controllers/PesananPenggunaController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function createPesananPengguna()
    {
        $userId = session()->get('user_id'); // Ambil ID pengguna dari sesi
        $userModel = new \App\Models\UserModel(); // Pastikan model UserModel sudah ada
        $user = $userModel->find($userId); // Cari pengguna berdasarkan ID