app/Controllers/ProfilePenggunaController.php

    public function index()
    {

        return view('profile/index');

        $session = session();
        $userId = $session->get('user_id');

        // Ambil data pengguna
        $db = \Config\Database::connect();
        $builder = $db->table('users');
        $user = $builder->where('id', $userId)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = '1'