app/Controllers/UserWhatsAppController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function index()
    {
        $userId = session()->get('user_id'); // Ambil user_id dari session
        $user = $this->userModel->find($userId);

UPDATE `users` SET `whatsapp_number` = '081238642023', `is_main_whatsapp` = 0, `updated_at` = '2025-01-01 13:08:27'
WHERE `users`.`id` IN ('1')
---
    public function tambahWhatsAppPengguna()
    {
        $userId = session()->get('user_id'); // Ambil user_id dari session
        $whatsappNumber = $this->request->getPost('whatsapp_number');
        $isMain = $this->request->getPost('is_main') ? 1 : 0;

        $data = [
            'whatsapp_number' => $whatsappNumber,
            'is_main_whatsapp' => $isMain
        ];

        // Menambahkan atau mengupdate data nomor WhatsApp
        $this->userModel->update($userId, $data);